WHeiu/Drone-control-project/无人机管控模块/程序/stm32_new_HAL_LL/Stm32_New-1.0.6/Src/main.c
	uint8_t UART4_Tx_GPS_TEST0[]="AT\r\n";
	uint8_t UART4_Tx_GPS_TEST1[]="AT+QGPS=1\r\n";
	uint8_t UART4_Tx_GPS_TEST2[]="AT+QGPSLOC?\r\n";
	uint8_t UART4_Tx_GPS_TEST3[]="AT+QGPSCFG=\"gpsnmeatype\",1\r\n";
	uint8_t UART4_Tx_GPS_TEST4[]="AT+GSN\r\n";
	uint8_t UART4_Tx_GPS_TEST5[]="AT+QICLOSE=0\r\n";

	/*IP 地址口（可变）*/
  uint8_t UART4_Tx_TCP_TEST1[]="AT+QIOPEN=1,0,\"TCP\",\"119.27.184.248\",1234,0,1\r\n";
	uint8_t UART4_Tx_TCP_TEST2[]="AT+QISEND=0\r\n";
	uint8_t UART4_Tx_TCP_TEST3[]="AT+QICLOSE=0\r\n";
	
	uint8_t UART4_Tx_MESSAGE1[]="AT+CPMS?\r\n";
	uint8_t UART4_Tx_MESSAGE2[]="AT+CNMI=1,2,0,1,0\r\n";
	uint8_t UART4_Tx_MESSAGE3[]="AT+CSCA?\r\n";
	uint8_t UART4_Tx_MESSAGE4[]="AT+CMGF=1\r\n";
	
	char TEST_BUF[20];
	int Receive_Count=0;
	int UART4_Receive_Count=0;
   //printf重定向串口3
int fputc(int ch, FILE *f)
{
	uint8_t c=(uint8_t) (ch & 0x00FF);
  HAL_UART_Transmit(&huart3,&c,1,10);
  
  return ch;
}
 void Clear_RecvBuf(void)
{
  for(int i = 0; i < COUNTOF(ReceiveBuff); i++) 
    ReceiveBuff[i]=0;
}

 void USART_CLR_RecvBuf(void)
{
	memset(ReceiveBuff, 0, RXLEN);//sizeof(NB_Receive_Buf));//清除USART1接收缓存区
	memset(UART4_ReceiveBuff, 0, RXLEN);//sizeof(NB_Receive_Buf));//清除USART1接收缓存区
	Receive_Count = 0;
	UART4_Receive_Count=0;
}

void Delay(unsigned int xms)  // xms
{
    unsigned int x,y;
    for(x=xms;x>0;x--)
        for(y=2000;y>0;y--);
}
char * EC20_sendmsg_cmd1[]={
	"AT+CPMS?\r\n",
	"AT+CNMI=1\r\n",
	"AT+CSCA?\r\n",
	"AT+CMGF=1\r\n",
};
void EC20_Transmit(uint8_t* UART4_Tx)
{ 
	 int size=strlen((const char*)UART4_Tx);
   HAL_UART_Transmit(&huart4, (uint8_t*)UART4_Tx,size,50);
}

void EC20_Transmit_Printf(uint8_t* UART4_Tx)
{ 
	 int size=strlen((const char*)UART4_Tx);
	 HAL_UART_Transmit(&huart3, (uint8_t*)UART4_Tx,size,50);
}
void EC20_Receive(void)
{
	   HAL_UART_Receive(&huart4, (uint8_t*)ReceiveBuff, COUNTOF(ReceiveBuff),50);
	#if 1
		/*打印收到的数据*/
    for(int i=0;i<COUNTOF(ReceiveBuff);i++)
    {
			  if(ReceiveBuff[i]=='O'&&ReceiveBuff[i+1]=='K')
				{  
					printf("OK\r\n");
					break;
				}
				if(ReceiveBuff[i]=='\0'&&ReceiveBuff[i+1]=='\0'&&ReceiveBuff[i+2]=='\0'&&ReceiveBuff[i+3]=='\0')
				{  
					printf("\n****** 	\r\n");
					break;
				}
				if(ReceiveBuff[i]=='0'&&ReceiveBuff[i+1]=='0'&&ReceiveBuff[i+2]=='0'&&ReceiveBuff[i+3]=='0')
				{  
					break;
				}
        printf("%c",ReceiveBuff[i]);
    }
    printf("\r\n"); 
    for(int i=0;i<=(COUNTOF(ReceiveBuff) - 1);i++)
		{
			if(ReceiveBuff[i]==':'&&ReceiveBuff[i-1]=='C'&&ReceiveBuff[i-2]=='O')
			{
				 i++;
				 for(int j=0;i<=(COUNTOF(ReceiveBuff) - 1);i++,j++)
					{
							/* 转换：之后的GPS数据 给GPS_DATA*/
						   if(ReceiveBuff[i]=='\0'&&ReceiveBuff[i+1]=='\0'&&ReceiveBuff[i+2]=='\0'&&ReceiveBuff[i+3]=='\0')
								{  
									printf("\n****** 	\r\n");
									break;
								}
								
						   GPS_DATA_RECEIVE[j]=ReceiveBuff[i];
							 if(ReceiveBuff[i]=='O'&&ReceiveBuff[i+1]=='K')
								{
									 printf("GPS数据\n");   
									break;
								}
								
							 printf("%c",ReceiveBuff[i]);
							 
					}
				}
		}			
		/*清空数据缓存*/
  Clear_RecvBuf();
	#endif
			
}
void EC20_Init()
{	 
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);
			LL_mDelay(200);	
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_RESET);//拉高控制
			LL_mDelay(300);	
	   //	EC20_UART_PROT_INIT();//改变EC20 的串口模式
			LL_mDelay(200);
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);//初始化完成
}



void convertUnCharToStr(char* str, unsigned char* UnChar, int ucLen)

{
	int i = 0;
	for(i = 0; i < ucLen; i++)
	{
		//格式化输str,每unsigned char 转换字符占两位置%x写输%X写输
		sprintf(str + i * 2, "%02x", UnChar[i]);
	}

}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  //int i=0;
	 LL_Init();
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
 

  /* USER CODE BEGIN Init */
 
	uint32_t Uart_count=0;  //Uart_count is used to test uart 
	
	uint8_t Flag_test=SUCCFULL_STA;    //set one
	uint8_t Flag_run =SUCCFULL_STA-1;  //set zero
	
	uint32_t ADC_Value[50];
	uint32_t ad1;
	uint8_t  ADC_i;


	
  uint8_t UART4_Tx_Flag_end[]={0x1A};
	uint8_t UART4_Tx_CMGS_ER[]="ERROR!!\r\n";
	uint8_t UART4_Tx_CMGS_end[]={0x1A};
	
	uint8_t UART4_Tx_CMGS[]="HELLO,WORLD!!!CONNECTED SUCUSSFUL!!!\r\n";

	
	uint8_t tempdata[50]={0};
	
	uint8_t Atempdata1[50]={0};
	uint8_t Atempdata2[50]={0};
	uint8_t Atempdata3[50]={0};
	
	uint8_t tempdata1[20]={0};
	uint8_t tempdata2[20]={0};
	uint8_t tempdata3[20]={0};
	uint8_t tempdata4[20]={0};
	uint8_t tempdata5[20]={0};
	uint8_t tempdata6[20]={0};
	uint8_t tempdata7[20]={0};
	
	uint8_t test_count=0;
	uint8_t test_flag=1;
	uint8_t count_ex=100;
	uint8_t count_OK=0;
	uint8_t *pTempdate;
	uint8_t m=0;
	uint8_t test_counter_polling=0;
	float altitude1; //存放初始高度
	float value=1.234;
	uint8_t t=0;	            		//默认开启上报
//	u8 key;
	float pitch,roll,yaw; 	        		//欧拉角
	short aacx,aacy,aacz;	        		//加速度传感器原始数据
	short gyrox,gyroy,gyroz;        		//陀螺仪原始数据 
	short temp;		                		//温度 
	char buf[100];
	uint8_t tbuf[18]; 
	char Pitch[100];
  char Roll[100];
	char Yaw[100];
	
	
	pTempdate=tempdata;
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
	MX_GPIO_Init();       //  .........................................
//  MX_CRC_Init();
//	MX_RTC_Init();
 // MX_DMA_Init();
	//MX_UART4_Init();         ...........................................
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
 // MX_USART3_UART_Init();         ..........................................
  MX_QUADSPI_Init();

  MX_SPI1_Init();
  MX_SPI2_Init();
//  MX_ADC1_Init();

//  MX_USB_OTG_FS_HCD_Init();

  /* Initialize interrupts */
 // MX_NVIC_Init();                  .............................................
  /* USER CODE BEGIN 2 */
	
//  MX_GPIO_Init();
 
